================================================================================
Level 1 Quote
================================================================================
> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item1
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Level 2 Quote
================================================================================
>> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item2
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Level 3 Quote
================================================================================
>>> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item3
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Level 4 Quote
================================================================================
>>>> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item4
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Level 5 Quote
================================================================================
>>>>> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item5
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Level 6 Quote
================================================================================
>>>>>> Quote content
spanning a paragraph

but not further
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item6
      (prefix)
      (paragraph
        (paragraph_segment)
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Nested Quote
================================================================================
>> item 2
>>> item 3
>>>> item 4
>> item 2
> item 1
>>>>>> item 6
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item2
      (prefix)
      (paragraph
        (paragraph_segment))
      (quote_item3
        (prefix)
        (paragraph
          (paragraph_segment))
        (quote_item4
          (prefix)
          (paragraph
            (paragraph_segment)))))
    (quote_item2
      (prefix)
      (paragraph
        (paragraph_segment)))
    (quote_item1
      (prefix)
      (paragraph
        (paragraph_segment))
      (quote_item6
        (prefix)
        (paragraph
          (paragraph_segment))))))

================================================================================
Quote Starting With Level Greater than 1
================================================================================
>>>>> Level 5 Quote
--------------------------------------------------------------------------------

(document
  (quote
    (quote_item5
      (prefix)
      (paragraph
        (paragraph_segment)))))
