================================================================================
Infirm Tag
================================================================================
.infirm-one
.infirm-two.with.nested.content
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (word)))
  (infirm_tag
    (tag_name
      (word)
      (word)
      (word)
      (word))))

================================================================================
Infirm Tag with Parameters
================================================================================
.infirm parameter
.infirm-two parameter second-parameter
.infirm-three parameter\ one parameter\ two
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (word))
    (tag_parameters
      (tag_parameter)))
  (infirm_tag
    (tag_name
      (word))
    (tag_parameters
      (tag_parameter)
      (tag_parameter)))
  (infirm_tag
    (tag_name
      (word))
    (tag_parameters
      (tag_parameter
        (escape_sequence
          (escape_char)))
      (tag_parameter
        (escape_sequence
          (escape_char))))))

================================================================================
Ranged Verbatim Tag
================================================================================
@tag
@end

@tag.subtag
this is
some

content
@end

@tag
@this should not be a tag
@end

@tag
test @end
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (word)))
  (ranged_verbatim_tag
    (tag_name
      (word)
      (word))
    (ranged_verbatim_content))
  (ranged_verbatim_tag
    (tag_name
      (word))
    (ranged_verbatim_content))
  (ranged_verbatim_tag
    (tag_name
      (word))
    (ranged_verbatim_content)))

================================================================================
Ranged Verbatim Tag with Parameters
================================================================================
@tag
this is some content
@end
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (word))
    (ranged_verbatim_content)))
